app/views/buddies/index.haml

SELECT "buddies".* FROM "buddies"
---
  .buddyListHeader
    = "Contacts (" + (@buddies.count - 1).to_s + ")"
    .buddyListHeaderBtn{:onclick => "toggleBuddies();"}
  .buddyList