app/controllers/buddies_controller.rb

SELECT "buddies".* FROM "buddies"
---
  def index

    @session = Session.get_session_by_id cookies.signed[:chgo_user_session][0]
    org_id = @session["token"].split('!')[0]
    Org.synchronize_simple org_id, @session["instance_url"], @session["token"]
    org = Org.get_org_by_sfid(org_id)
    @buddies = Buddy.get_buddies_by_org org["id"]
    @org_channel = Channel.get_ring_communication @session["buddy_id"], org_id
    Connection.connect_buddy @session["buddy_id"], @org_channel[:id]

    mychannels = Channel.joins(:connection).where(:connections => {:buddy_id => @session["buddy_id"]}, :mod =>  'chat')
    @myBuddiesMap = {}
    myBuddiesConnection = Connection.where 'channel_id IN (:mychannels) AND buddy_id <> :myBuddy', {:mychannels => mychannels, :myBuddy => @session["buddy_id"]}